MITEVT/stm32f7_libs/examples/rtos_demo/src/main.c
#include <stdio.h>
#include <string.h>
// #include <stdlib.h>

/* STM CUBE files */
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "stm32f7xx_hal_conf.h"

/* FreeRTOS include files. */
#include "FreeRTOSConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "FreeRTOS_CLI.h"
// #include "port.c"

/* Project include files */
#include "board.h"

// void SysTick_Handler(void) {
// 	xPortSysTickHandler();
// }

/* Priorities at which the tasks are created. */
#define mainCOMMAND_CONSOLE_TASK_PRIORITY	(tskIDLE_PRIORITY + 1)
#define mainQUEUE_RECEIVE_TASK_PRIORITY		(tskIDLE_PRIORITY + 2)
#define	mainQUEUE_SEND_TASK_PRIORITY		(tskIDLE_PRIORITY + 1)

/* The rate at which data is sent to the queue.  The 200ms value is converted
to ticks using the portTICK_PERIOD_MS constant. */
#define mainQUEUE_SEND_FREQUENCY_MS			(500 / portTICK_PERIOD_MS)

/* The number of items the queue can hold.  This is 1 as the receive task
will remove items as they are added, meaning the send task should always find
the queue empty. */
#define mainQUEUE_LENGTH					(1)

/*-----------------------------------------------------------*/

/*
 * Configure the hardware as necessary to run this demo.
 */
static void prvSetupHardware(void);

#define ADC_TIMEOUT 1

/*
 * Configure the system clock for maximum speed.
 */
static void prvSystemClockConfig(void);


static void prvQueueSendTask(void *pvParameters);
static void prvQueueReceiveTask(void *pvParameters);

/* Prototypes for the standard FreeRTOS callback/hook functions implemented
within this file. */
void vApplicationMallocFailedHook(void);
void vApplicationIdleHook(void);
void vApplicationStackOverflowHook(TaskHandle_t pxTask, char *pcTaskName);
void vApplicationTickHook(void);

/* The queue used by both tasks. */
static QueueHandle_t xQueue = NULL;

/* Console UART Handler Type */
static UART_HandleTypeDef usart3;

/* ADC command handle */
static ADC_HandleTypeDef adc1;

/* DMA command handle and test storage */
#define DMA_TEST_SIZE 64
static DMA_HandleTypeDef dma2;
static volatile uint32_t dma_dest[DMA_TEST_SIZE];

/*-----------------------------------------------------------*/
/* Command Line Definitions */

void vCommandConsoleTask(void *pvParameters);
static BaseType_t prvToggleLEDCommand(char*, size_t, const char*);
static BaseType_t prvFreqCommand(char*, size_t, const char*);
static BaseType_t prvSampleADC(char*, size_t, const char*);
static BaseType_t prvSystemReset(char*, size_t, const char*);
static BaseType_t prvDMATest(char*, size_t, const char*);

static const CLI_Command_Definition_t xToggleLEDCommand = {
    "toggle-led",
    "toggle-led <num>: Toggle LED<num>\r\n",
    prvToggleLEDCommand,
    1
};

static const CLI_Command_Definition_t xFreqCommand = {
    "freq",
    "freq: Get CPU Frequency\r\n",
    prvFreqCommand,
    0
};

static const CLI_Command_Definition_t xSampleADCCommand = {
	"adc",
	"adc: Sample from A0\r\n",
	prvSampleADC,
	0
};

static const CLI_Command_Definition_t xSystemReset = {
	"reset",
	"reset: Perform a software reset\r\n",
	prvSystemReset,
	0
};

static const CLI_Command_Definition_t xDMATest = {
	"dma-test",
	"dma-test: Perform a memory-memory dma test",
	prvDMATest,
	0
};

/*-----------------------------------------------------------*/

int main(void) {
	/* Configure the hardware ready to run the demo. */
	prvSetupHardware();

	FreeRTOS_CLIRegisterCommand(&xToggleLEDCommand);
	FreeRTOS_CLIRegisterCommand(&xFreqCommand);
	FreeRTOS_CLIRegisterCommand(&xSampleADCCommand);
	FreeRTOS_CLIRegisterCommand(&xSystemReset);
	FreeRTOS_CLIRegisterCommand(&xDMATest);
	xTaskCreate(vCommandConsoleTask, "console", configMINIMAL_STACK_SIZE*4, &usart3, mainCOMMAND_CONSOLE_TASK_PRIORITY, NULL);

	/* Create the queue. */
	xQueue = xQueueCreate(mainQUEUE_LENGTH, sizeof( uint32_t ));

	if(xQueue != NULL) {
		/* Start the two tasks as described in the comments at the top of this
		file. */
		xTaskCreate(prvQueueReceiveTask,				/* The function that implements the task. */
					"Rx", 								/* The text name assigned to the task - for debug only as it is not used by the kernel. */
					configMINIMAL_STACK_SIZE, 			/* The size of the stack to allocate to the task. */
					NULL, 								/* The parameter passed to the task - not used in this case. */
					mainQUEUE_RECEIVE_TASK_PRIORITY, 	/* The priority assigned to the task. */
					NULL);								/* The task handle is not required, so NULL is passed. */

		xTaskCreate(prvQueueSendTask, "TX", configMINIMAL_STACK_SIZE, NULL, mainQUEUE_SEND_TASK_PRIORITY, NULL);

		/* Start the tasks and timer running. */
		vTaskStartScheduler();
	}

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the Idle and/or
	timer tasks to be created.  See the memory management section on the
	FreeRTOS web site for more details on the FreeRTOS heap
	http://www.freertos.org/a00111.html. */
	for( ;; );

	return 0;
}

/*-----------------------------------------------------------*/

static void prvQueueSendTask(void *pvParameters) {
	TickType_t xNextWakeTime;
	const unsigned long ulValueToSend = 100UL;

	/* Remove compiler warning about unused parameter. */
	(void)pvParameters;

	/* Initialize xNextWakeTime - this only needs to be done once. */
	xNextWakeTime = xTaskGetTickCount();

	for( ;; )
	{
		/* Place this task in the blocked state until it is time to run again. */
		vTaskDelayUntil( &xNextWakeTime, mainQUEUE_SEND_FREQUENCY_MS );

		/* Send to the queue - causing the queue receive task to unblock and
		toggle the LED.  0 is used as the block time so the sending operation
		will not block - it shouldn't need to block as the queue should always
		be empty at this point in the code. */
		xQueueSend( xQueue, &ulValueToSend, 0U );
	}
}
/*-----------------------------------------------------------*/

static void prvQueueReceiveTask(void *pvParameters) {
	unsigned long ulReceivedValue;
	const unsigned long ulExpectedValue = 100UL;

	/* Remove compiler warning about unused parameter. */
	( void ) pvParameters;

	for( ;; )
	{
		/* Wait until something arrives in the queue - this task will block
		indefinitely provided INCLUDE_vTaskSuspend is set to 1 in
		FreeRTOSConfig.h. */
		xQueueReceive( xQueue, &ulReceivedValue, portMAX_DELAY );

		/*  To get here something must have been received from the queue, but
		is it the expected value?  If it is, toggle the LED. */
		if( ulReceivedValue == ulExpectedValue )
		{
			boardTOGGLE_LED1();
			ulReceivedValue = 0U;
		}
	}
}

/*-----------------------------------------------------------*/

static void prvSetupHardware(void) {

	/* Set Interrupt Group Priority */
	NVIC_SetPriorityGrouping((uint32_t)0x00000003U);

	/* Configure the System clock to have a frequency of 216 MHz */
	prvSystemClockConfig();

	__HAL_RCC_GPIOB_CLK_ENABLE();
	GPIO_InitTypeDef LED;
	LED.Mode = GPIO_MODE_OUTPUT_PP;
	LED.Pull = GPIO_NOPULL;
	LED.Speed = GPIO_SPEED_FREQ_LOW;
	LED.Pin = LD1_PIN; HAL_GPIO_Init(GPIOB, &LED);
	LED.Pin = LD2_PIN; HAL_GPIO_Init(GPIOB, &LED);
	LED.Pin = LD3_PIN; HAL_GPIO_Init(GPIOB, &LED);

