MITEVT/stm32f7_libs/examples/rtos_demo/src/main.c
	(void)xWriteBufferLen;
	(void)pcCommandString;

	char str[5];
    itoa(SystemCoreClock/1000000, str, 10);

    // snprintf(str, 5, "%lu", SystemCoreClock/1000000);

    memcpy(pcWriteBuffer, pcFreqStartMessage, strlen(pcFreqStartMessage));
    memcpy(pcWriteBuffer + strlen(pcFreqStartMessage), str, strlen(str));
    memcpy(pcWriteBuffer + strlen(pcFreqStartMessage) + strlen(str), pcFreqEndMessage, strlen(pcFreqEndMessage));

    /* There is only a single line of output produced in all cases.  pdFALSE is
    returned because there is no more output to be generated. */
    return pdFALSE;
}

/*-----------------------------------------------------------*/

static const char* const pcSampleADCEndMessage = 
	"\r\n";

static const char* const pcSampleADCErrorMessage =
	"Error During Sample\r\n";

static const char* const pcSampleADCTimeoutMessage =
	"ADC Timeout\r\n";

static BaseType_t prvSampleADC(char *pcWriteBuffer,
									size_t xWriteBufferLen,
									const char *pcCommandString) {

	(void)xWriteBufferLen;
	(void)pcCommandString;

	char str[4];

	HAL_ADC_Start(&adc1);
	HAL_StatusTypeDef status = HAL_ADC_PollForConversion(&adc1, ADC_TIMEOUT);
	if (status == HAL_ERROR) {
		memcpy(pcWriteBuffer, pcSampleADCErrorMessage, strlen(pcSampleADCErrorMessage));
	} else if (status == HAL_TIMEOUT) {
		memcpy(pcWriteBuffer, pcSampleADCTimeoutMessage, strlen(pcSampleADCTimeoutMessage));
	} else {
		itoa(HAL_ADC_GetValue(&adc1), str, 10);
		memcpy(pcWriteBuffer, str, strlen(str));
		memcpy(pcWriteBuffer+strlen(str), pcSampleADCEndMessage, strlen(pcSampleADCEndMessage));
	}

	return pdFALSE;
}

/*-----------------------------------------------------------*/

static BaseType_t prvSystemReset(char *pcWriteBuffer,
									size_t xWriteBufferLen,
									const char *pcCommandString) {

	(void)pcWriteBuffer;
	(void)xWriteBufferLen;
	(void)pcCommandString;

	NVIC_SystemReset();

	return pdFALSE;
}

/*-----------------------------------------------------------*/

static const char* const pcDMATestErrorMessage =
	": Error During DMA\r\n";

static const char* const pcDMATestTimeoutMessage =
	"DMA Timeout\r\n";

static const char* const pcDMATestPassMessage = 
	"DMA Passed\r\n";

static const char* const pcDMATestFailMessage =
	"DMA Failed\r\n";

static const uint32_t* const pcDMATestString = 
	{12, 36, 42, 33, 445, 543};

// Todo don't wait forever, just check and if not ready then return pdTrue!
static BaseType_t prvDMATest(char *pcWriteBuffer,
									size_t xWriteBufferLen,
									const char *pcCommandString) {

	(void)xWriteBufferLen;
	(void)pcCommandString;

	int i;

	HAL_DMA_Start(&dma2, pcDMATestString, dma_dest, 6);
	HAL_StatusTypeDef status = HAL_DMA_PollForTransfer(&dma2, HAL_DMA_FULL_TRANSFER, 1);
	if (status == HAL_ERROR) {
		uint32_t err = HAL_DMA_GetError(&dma2);
		uint8_t str[10];
		itoa(err, str, 16);
		memcpy(pcWriteBuffer, str, strlen(str));
		memcpy(pcWriteBuffer+strlen(str), pcDMATestErrorMessage, strlen(pcDMATestErrorMessage));
	} else if (status == HAL_TIMEOUT) {
		memcpy(pcWriteBuffer, pcDMATestTimeoutMessage, strlen(pcDMATestTimeoutMessage));
	} else {
		for (i = 0; i < 6; i++) {
			if (dma_dest[i] != pcDMATestString[i]) {
				memcpy(pcWriteBuffer, pcDMATestFailMessage, strlen(pcDMATestFailMessage));
				return pdFALSE;
			}
		}
		memcpy(pcWriteBuffer, pcDMATestPassMessage, strlen(pcDMATestPassMessage));
	}

	return pdFALSE;
}

/*-----------------------------------------------------------*/
/* HAL Init Functions*/

void HAL_UART_MspInit(UART_HandleTypeDef *husart) {
	if (husart->Instance == USART3) {
		__HAL_RCC_USART3_CLK_ENABLE();

		__HAL_RCC_GPIOD_CLK_ENABLE();
		GPIO_InitTypeDef UG;
		UG.Mode = GPIO_MODE_AF_PP;
		UG.Pull = GPIO_PULLUP;
		UG.Speed = GPIO_SPEED_FREQ_HIGH;
		UG.Alternate = GPIO_AF7_USART3;
		UG.Pin = GPIO_PIN_8; HAL_GPIO_Init(GPIOD, &UG);
		UG.Pin = GPIO_PIN_9; HAL_GPIO_Init(GPIOD, &UG);
	}
}

// ADC is fed by APB2 currently set to 108 Mhz
void HAL_ADC_MspInit(ADC_HandleTypeDef *hadc) {
	if (hadc->Instance == ADC1) {
		__HAL_RCC_ADC1_CLK_ENABLE();

		__HAL_RCC_GPIOA_CLK_ENABLE();
		GPIO_InitTypeDef UG;
		UG.Mode = GPIO_MODE_ANALOG;
		UG.Pull = GPIO_NOPULL;
		UG.Pin = GPIO_PIN_3;
		HAL_GPIO_Init(GPIOA, &UG);
	}

}




